David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/app_zigbee.c
  * @author  MCD Application Team
  * @author  David Shirvanyants
  * @brief   Zigbee Application. Implements outdoor light controller.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.temp.meas.h"
#include "zcl/general/zcl.illum.meas.h"

/* USER CODE BEGIN Includes */
#include "zcl.basic.h"
#include "main.h"
#include "hw_flash.h"
#include "ee.h"

#include "main.h"

#include "../../basic/analog.h"
#include "../../basic/binsensor.h"
#include "../../basic/multistate.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define CHANNEL                                     25

#define SW1_ENDPOINT                                1
#define SW2_ENDPOINT                                2
#define SW3_ENDPOINT                                3
#define SW4_ENDPOINT                                4
#define SW5_ENDPOINT                                5
#define SW6_ENDPOINT                                6

/* Temperature_meas (endpoint 1) specific defines ------------------------------------------------*/
#define TEMP_MIN_1                      -2000
#define TEMP_MAX_1                      5000
#define TEMP_TOLERANCE_1                      200
/* USER CODE BEGIN Temperature_meas (endpoint 1) defines */
/* USER CODE END Temperature_meas (endpoint 1) defines */

/* Illuminance_meas (endpoint 1) specific defines ------------------------------------------------*/
#define ILLUM_MIN_1                      1
#define ILLUM_MAX_1                      65534
/* USER CODE BEGIN Illuminance_meas (endpoint 1) defines */
/* USER CODE END Illuminance_meas (endpoint 1) defines */

/* USER CODE BEGIN PD */
#define CFG_NVM                 1U /* use FLASH */
#define RESET_ZB_NWK            0U

#define APP_ZIGBEE_STARTUP_REJOIN_DELAY               5000U

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* Our device is not configured as a sleepy end device, but CubeIDE still removes RXONDILE from the network setup.
 * When removed, this flag does not allow RX in idle state making Zigbee device slow to respond.
 * This macro re-definition neutralizes the auto-generated code and leaves RX always enabled.
 *
 * This hack allows to keep the project connected to the IOC file.
 *  */

#undef MCP_ASSOC_CAP_RXONIDLE
#define MCP_ASSOC_CAP_RXONIDLE 0

/*
 * Replacing the auto-generated macro with the hack below expands the channel list to all 2.4GHz channels.
 * As with the MCP_ASSOC_CAP_RXONIDLE, this hack is used to keep connection to the IOC project file.
 *  */
#undef CHANNEL
#define CHANNEL  1 ? (((1 << (26-11+1))-1) << 11) : 0
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

static void APP_ZIGBEE_ProcessNotifyM0ToM4(void);
static void APP_ZIGBEE_ProcessRequestM0ToM4(void);

/* USER CODE BEGIN PFP */

enum ZclStatusCodeT multistate_presentValue_CB(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *info);
enum ZclStatusCodeT analog_presentValue_CB(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *info, void *arg);

static void APP_ZIGBEE_setup_filter(void);
static void APP_ZIGBEE_ConfigBasic(void);

void set_default_attr_values(void);

static bool APP_ZIGBEE_persist_load(void);
static bool APP_ZIGBEE_persist_save(void);
static void APP_ZIGBEE_persist_delete(void);
static void APP_ZIGBEE_persist_notify_cb(struct ZigBeeT *zb, void *cbarg);
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT *zb);
static void APP_ZIGBEE_PersistCompleted_callback(enum ZbStatusCodeT status,void *arg);


#ifdef CFG_NVM
static void APP_ZIGBEE_NVM_Init(void);
static bool APP_ZIGBEE_NVM_Read(void);
static bool APP_ZIGBEE_NVM_Write(void);
static void APP_ZIGBEE_NVM_Erase(void);
#endif /* CFG_NVM */
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t   *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t   *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t   *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t    CptReceiveNotifyFromM0 = 0;
static __IO uint32_t    CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info
{
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  bool init_after_join;

  struct ZbZclClusterT *temperature_meas_server_1;
  struct ZbZclClusterT *illuminance_meas_server_1;
};
