David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
static struct zigbee_app_info zigbee_app_info;

/* USER CODE BEGIN PV */

/* NVM variables */

static unsigned int persistNumWrites = 0;

/* cache in uninit RAM to store/retrieve persistent data */
union cache
{
  uint8_t  U8_data[ST_PERSIST_MAX_ALLOC_SZ];     // in bytes
  uint32_t U32_data[ST_PERSIST_MAX_ALLOC_SZ/4U]; // in U32 words
};

union cache cache_persistent_data;
union cache cache_diag_reference;


struct ZbZclClusterT * analog_clusters[SW6_ENDPOINT];
struct ZbZclClusterT * multistate_cluster;
struct ZbZclClusterT * binary_cluster_light_on;
struct ZbZclClusterT * binary_cluster_motion_detect;
struct ZbZclClusterT * binary_cluster_dusk_detect;

const char *opmode_state_text[] = {
		"Auto",
		"Full",
		"Dim",
		"Off"
};

struct analog_cluster_attr {
	float value;
	float minPresent, maxPresent;
	float step;
	char desc[16];
	enum analog_mode mode;
	uint16_t engUnit;
	uint16_t icon;
	int32_t *extSetting;
	void (*ext_setting_cb)(int32_t *value);
} analog_cluster_attrs[] = {
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x09" "Dim level",
				.value = 50.0,
				.minPresent = 1.0,
				.maxPresent = 100.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_BRIGHTNESS_PERCENT,
				.extSetting = &dimLevel,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0a" "Dusk level",
				.value = 70.0,
				.minPresent = 1.0,
				.maxPresent = 200.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_BRIGHTNESS_PERCENT,
				.extSetting = &ambientThreshold,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0d" "Motion detect",
				.value = 80.0,
				.minPresent = 0.0,
				.maxPresent = 100.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_PERCENT,
				.icon = ZCL_ANALOG_ICON_PERCENT,
				.extSetting = &motionSensitivity,
				.ext_setting_cb = update_motion_sensitivity,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0c" "After motion",
				.value = 300.0,
				.minPresent = 0.0,
				.maxPresent = 2*3600.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_SECONDS,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &motionLight,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0c" "After dusk",
				.value = 0.0,
				.minPresent = 1.0,
				.maxPresent = 12*60.0,
				.step = 1.0,
				.engUnit = ZCL_ENGINEERING_UNIT_MINUTES,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &nightLight,
		},
		{
				.mode = ANALOG_OUTPUT,
				.desc = "\x0d" "Phase correct",
				.value = -300,
				.minPresent = -10000.0,
				.maxPresent = 10000,
				.step = 1,
				.engUnit = ZCL_ENGINEERING_UNIT_MICROSECONDS,
				.icon = ZCL_ANALOG_ICON_TIMER,
				.extSetting = &phase_correction,
		},
};

/* Stored attributes' values */
static uint8_t lightState = 0;
static uint8_t motionState = 0;
static uint8_t duskState = 0;

/* Data block for NVM storage */
struct persistence_attrs {
	uint32_t struct_len;
	float analogValues[lengthof(analog_cluster_attrs)];
	uint32_t multistateValue;
};



/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessNotifyM0ToM4);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessRequestM0ToM4);

  /* Task associated with network creation process */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, UTIL_SEQ_RFU, APP_ZIGBEE_NwkForm);

  /* USER CODE BEGIN APP_ZIGBEE_INIT */
//  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_REJOIN, UTIL_SEQ_RFU, APP_ZIGBEE_NwkRejoin);

  /* NVM Init */
#if CFG_NVM
  APP_ZIGBEE_NVM_Init();
#endif

  /* USER CODE END APP_ZIGBEE_INIT */

  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();

}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_StackLayersInit(void)
{
  APP_DBG("APP_ZIGBEE_StackLayersInit");

  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  APP_ZIGBEE_setup_filter();

  /* STEP 1 - TRY to START FROM PERSISTENCE */
  enum ZbStatusCodeT status = ZbNwkIfSetTxPower(zigbee_app_info.zb, "wpan0", 6) ? 1 : 0;

  /* First we disable the persistent notification */
  ZbPersistNotifyRegister(zigbee_app_info.zb,NULL,NULL);

  /* Increase transmission power (to 3.7dbm). Default setting is 0. */
  ZbNwkIfSetTxPower(zigbee_app_info.zb, "wpan0", 6);
  enum ZbStatusCodeT res;

  /* Remove parent link strength threshold. This application does not transmit frequent data
   * and association happens faster when more nodes are available.  */
  uint32_t bdb_flags = 0;
  res = ZbBdbGetIndex(zigbee_app_info.zb, ZB_BDB_Flags, &bdb_flags, sizeof(bdb_flags), 0);
  if (ZB_STATUS_SUCCESS == res) {
	  bdb_flags |= ZB_BDB_FLAG_IGNORE_COST_DURING_JOIN;
	  ZbBdbGetIndex(zigbee_app_info.zb, ZB_BDB_Flags, &bdb_flags, sizeof(bdb_flags), 0);
  }


