David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
  /* Call a startup from persistence */
#if CFG_NVM
#if (RESET_ZB_NWK)
  APP_ZIGBEE_persist_delete();
#endif
#endif

  status = APP_ZIGBEE_ZbStartupPersist(zigbee_app_info.zb);
  if(status == ZB_STATUS_SUCCESS)
  {
     /* no fresh startup need anymore */
     APP_DBG("ZbStartupPersist: SUCCESS, restarted from persistence");

     /* Extend default persistence timeouts. Default value of 10s is too frequent and is unnecessary in this application. */
     uint32_t pers_tm = 0;
     res = ZbBdbGetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs, &pers_tm, 4, 0);
     if (ZB_STATUS_SUCCESS == res) {
   	  pers_tm *= 10;
   	  ZbBdbSetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs, &pers_tm, sizeof(pers_tm), 0);
     }

     zigbee_app_info.join_delay = HAL_GetTick(); /* now */
     zigbee_app_info.startupControl = ZbStartTypeJoin;
     zigbee_app_info.join_status = ZB_STATUS_SUCCESS;
     ZbZclAttrReportKick(multistate_cluster, true, NULL, NULL);
     return;
  }
  else
  {
       /* Start-up form persistence failed perform a fresh ZbStartup */
       APP_DBG("ZbStartupPersist: FAILED to restart from persistence with status: 0x%02x",status);
  }
  /* USER CODE END APP_ZIGBEE_StackLayersInit */

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeJoin;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;

  /* run the task */
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* Endpoint: SW1_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Temperature meas server */
  zigbee_app_info.temperature_meas_server_1 = ZbZclTempMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, TEMP_MIN_1, TEMP_MAX_1, TEMP_TOLERANCE_1);
  assert(zigbee_app_info.temperature_meas_server_1 != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.temperature_meas_server_1);
  /* Illuminance meas server */
  zigbee_app_info.illuminance_meas_server_1 = ZbZclIllumMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, ILLUM_MIN_1, ILLUM_MAX_1);
  assert(zigbee_app_info.illuminance_meas_server_1 != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.illuminance_meas_server_1);
  /* Endpoint: SW2_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW2_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW3_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW3_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW4_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW4_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW5_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_LEVEL_OUTPUT;
  req.endpoint = SW5_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Endpoint: SW6_ENDPOINT */
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_ONOFF_SWITCH;
  req.endpoint = SW6_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* USER CODE BEGIN CONFIG_ENDPOINT */
  struct zcl_msv_attr_callbacks_t cb = {
		  .msv_presentValue = multistate_presentValue_CB,
  };
  multistate_cluster = ZbZcl_msv_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, MULTISTATE_VALUE,
		  lengthof(opmode_state_text), opmode_state_text, &cb, NULL);
  assert(multistate_cluster != NULL);

  char *msv_desc = "\x09" "Operation";
  (void)ZbZclAttrStringWriteShort(multistate_cluster, ZCL_MULTISTATE_DESCRIPTION_ATTR, (uint8_t*)msv_desc);

  ZbZclClusterEndpointRegister(multistate_cluster);

  unsigned ep_idx;
  for (ep_idx = SW1_ENDPOINT; ep_idx <= SW6_ENDPOINT; ep_idx += 1) {
	  unsigned cl_idx = ep_idx - 1;
	  struct zcl_analog_attr_callbacks_t analog_cb = {
			  .read = NULL,
			  .write = analog_presentValue_CB,
	  };

	  analog_clusters[cl_idx] = ZbZcl_Analog_ServerAlloc(
			  zigbee_app_info.zb,
			  ep_idx,
			  analog_cluster_attrs[cl_idx].mode,
			  &analog_cluster_attrs[cl_idx].value,
			  &analog_cb,
			  &analog_cluster_attrs[cl_idx]);

	  assert(analog_clusters[cl_idx] != NULL);

	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_PRESENT_VALUE_ATTR, analog_cluster_attrs[cl_idx].value);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_MAX_PRESENT_ATTR, analog_cluster_attrs[cl_idx].maxPresent);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_MIN_PRESENT_ATTR, analog_cluster_attrs[cl_idx].minPresent);
	  (void)ZbZclAttrFloatWrite(analog_clusters[cl_idx], ZCL_ANALOG_RESOLUTION_ATTR, analog_cluster_attrs[cl_idx].step);
	  (void)ZbZclAttrIntegerWrite(analog_clusters[cl_idx], ZCL_ANALOG_ENGINEERING_UNITS_ATTR, analog_cluster_attrs[cl_idx].engUnit);
	  (void)ZbZclAttrIntegerWrite(analog_clusters[cl_idx], ZCL_ANALOG_APPLICATION_TYPE_ATTR, analog_cluster_attrs[cl_idx].icon << 16);
	  (void)ZbZclAttrStringWriteShort(analog_clusters[cl_idx], ZCL_ANALOG_DESCRIPTION_ATTR, (uint8_t*)analog_cluster_attrs[cl_idx].desc);
	  ZbZclClusterEndpointRegister(analog_clusters[cl_idx]);
  }

  binary_cluster_light_on = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, BINARY_SENSOR_INPUT,
		  &lightState, NULL, NULL);
  assert(binary_cluster_light_on != NULL);
  ZbZclClusterEndpointRegister(binary_cluster_light_on);

  uint8_t light_on_sensor_desc[] = "\x0b" "Light state";
  (void)ZbZclAttrStringWriteShort(binary_cluster_light_on, ZCL_BINARY_DESCRIPTION_ATTR, light_on_sensor_desc);


  binary_cluster_dusk_detect = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW2_ENDPOINT, BINARY_SENSOR_INPUT,
		  &duskState, NULL, NULL);
  assert(binary_cluster_dusk_detect != NULL);

