David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
  ZbZclClusterEndpointRegister(binary_cluster_dusk_detect);

  uint8_t dusk_detect_sensor_desc[] = "\x0b" "Dusk detect";
  (void)ZbZclAttrStringWriteShort(binary_cluster_dusk_detect, ZCL_BINARY_DESCRIPTION_ATTR, dusk_detect_sensor_desc);

  binary_cluster_motion_detect = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW3_ENDPOINT, BINARY_SENSOR_INPUT,
		  &motionState, NULL, NULL);
  assert(binary_cluster_motion_detect != NULL);

  uint8_t motion_detect_sensor_desc[] = "\x0d" "Motion detect";
  (void)ZbZclAttrStringWriteShort(binary_cluster_motion_detect, ZCL_BINARY_DESCRIPTION_ATTR, motion_detect_sensor_desc);

  ZbZclClusterEndpointRegister(binary_cluster_motion_detect);

#if (!USE_TRAILING_EDGE)
/* This section is disabled because the current triac control is not compatible with the trailing edge drive mode */
  binary_triac_mode_cluster = ZbZcl_Binary_ServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, BINARY_SENSOR_OUTPUT,
		  &trailing_edge, NULL, NULL);
  assert(binary_triac_mode_cluster != NULL);
  ZbZclClusterEndpointRegister(binary_triac_mode_cluster);

  uint8_t triac_mode_desc[] = "\x0d" "Trailing edge";
  (void)ZbZclAttrStringWriteShort(binary_triac_mode_cluster, ZCL_BINARY_DESCRIPTION_ATTR, triac_mode_desc);
#endif

  APP_ZIGBEE_ConfigBasic();
  set_default_attr_values();
  /* USER CODE END CONFIG_ENDPOINT */
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkForm(void)
{
  if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
  {
    struct ZbStartupT config;
    enum ZbStatusCodeT status;

    /* Configure Zigbee Logging */
    ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_5, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    /* Set the centralized network */
    APP_DBG("Network config : APP_STARTUP_CENTRALIZED_ROUTER");
    config.startupControl = zigbee_app_info.startupControl;

    /* Using the default HA preconfigured Link Key */
    memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);

    config.channelList.count = 1;
    config.channelList.list[0].page = 0;
    config.channelList.list[0].channelMask = 1 << CHANNEL; /*Channel in use */

    /* Using ZbStartupWait (blocking) */
    status = ZbStartupWait(zigbee_app_info.zb, &config);

    APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
    zigbee_app_info.join_status = status;

    if (status == ZB_STATUS_SUCCESS)
    {
      zigbee_app_info.join_delay = 0U;
      zigbee_app_info.init_after_join = true;
      APP_DBG("Startup done !\n");
      /* USER CODE BEGIN 0 */

#if CFG_NVM
      /* Register Persistent data change notification */
      ZbPersistNotifyRegister(zigbee_app_info.zb,APP_ZIGBEE_persist_notify_cb,NULL);
      /* Call the callback once here to save persistence data */
      APP_ZIGBEE_persist_notify_cb(zigbee_app_info.zb,NULL);
#endif
      ZbZclAttrReportKick(multistate_cluster, true, NULL, NULL);
      /* Extend default persistence timeouts. Default value of 10s is too frequent and is unnecessary in this application. */
      uint32_t pers_tm = 0;
      enum ZbStatusCodeT res = ZbBdbGetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs, &pers_tm, 4, 0);
      if (ZB_STATUS_SUCCESS == res) {
    	  pers_tm *= 10;
    	  ZbBdbSetIndex(zigbee_app_info.zb, ZB_BDB_PersistTimeoutMs, &pers_tm, sizeof(pers_tm), 0);
      }

      /* USER CODE END 0 */
    }
    else
    {
      APP_DBG("Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
      zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
      /* USER CODE BEGIN 1 */
      if (status != ZB_NWK_STATUS_NO_NETWORKS) {
    	  zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_REJOIN_DELAY;
      }
      if (status == ZB_NWK_STATUS_INVALID_REQUEST || ZB_APS_STATUS_SECURITY_FAIL == status) {
    	  /* Some router devices return these error codes during first join and M0 firmware becomes
    	   * unable to join after that. It keeps sending same data and receives same error code
    	   * over and over again.
    	   * Restarting the joining process with ZbReset() seems to help most of the time. */
    	  ZbReset(zigbee_app_info.zb);
      }

      /* USER CODE END 1 */
    }
  }

  /* If Network forming/joining was not successful reschedule the current task to retry the process */
  if (zigbee_app_info.join_status != ZB_STATUS_SUCCESS)
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
  }
  /* USER CODE BEGIN NW_FORM */
  /* USER CODE END NW_FORM */
}

/*************************************************************
 * ZbStartupWait Blocking Call
 *************************************************************/
struct ZbStartupWaitInfo
{
  bool active;
  enum ZbStatusCodeT status;
};

static void ZbStartupWaitCb(enum ZbStatusCodeT status, void *cb_arg)
{
  struct ZbStartupWaitInfo *info = cb_arg;

  info->status = status;
  info->active = false;
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_STARTUP_ENDED);
}

enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config)
{
  struct ZbStartupWaitInfo *info;
  enum ZbStatusCodeT status;

  info = malloc(sizeof(struct ZbStartupWaitInfo));
  if (info == NULL)
  {
    return ZB_STATUS_ALLOC_FAIL;
  }
  memset(info, 0, sizeof(struct ZbStartupWaitInfo));

  info->active = true;
  status = ZbStartup(zb, config, ZbStartupWaitCb, info);
  if (status != ZB_STATUS_SUCCESS)
  {
    free(info);
    return status;
  }

  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_STARTUP_ENDED);
  status = info->status;
  free(info);
  return status;
}

/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId :
 * @param  ErrCode
 * @retval None
 */
void APP_ZIGBEE_Error(uint32_t ErrId, uint32_t ErrCode)
{
  switch (ErrId)
  {
    default:
      APP_ZIGBEE_TraceError("ERROR Unknown ", 0);
      break;
  }
}

