David-EIPI/stm32-zigbee-light/firmware/STM32_WPAN/App/app_zigbee.c
/*************************************************************
 *
 * NVM FUNCTIONS
 *
 *************************************************************/
static void APP_ZIGBEE_pack_persist_values(struct persistence_attrs *persistence_attrs)
{
    persistence_attrs->struct_len = sizeof(struct persistence_attrs);

    unsigned n;
    for (n = 0; n < lengthof(analog_cluster_attrs); n++)
    	persistence_attrs->analogValues[n] = analog_cluster_attrs[n].value;

    persistence_attrs->multistateValue = operationMode;
}

static void APP_ZIGBEE_unpack_persist_values(struct persistence_attrs *persistence_attrs)
{
	if (persistence_attrs->struct_len == sizeof(struct persistence_attrs)) {
		unsigned n;
		for (n = 0; n < lengthof(analog_cluster_attrs); n++)
			analog_cluster_attrs[n].value = persistence_attrs->analogValues[n];

		operationMode = persistence_attrs->multistateValue;
	}
}

/**
 * @brief  notify to save persistent data callback
 * @param  zb: Zigbee device object pointer, cbarg: callback arg pointer
 * @retval None
 */
static void APP_ZIGBEE_persist_notify_cb(struct ZigBeeT *zb, void *cbarg)
{
  APP_DBG("Notification to save persistent data requested from stack");
  /* Save the persistent data */
  APP_ZIGBEE_persist_save();
}

/**
 * @brief  Start Zigbee Network from persistent data
 * @param  zb: Zigbee device object pointer
 * @retval Zigbee stack Status code
 */
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT* zb)
{
   bool read_status;
   enum ZbStatusCodeT status = ZB_STATUS_SUCCESS;

   /* Restore persistence */
   read_status = APP_ZIGBEE_persist_load();

   if (read_status)
   {
       /* Make sure the EPID is cleared, before we are allowed to restore persistence */
       uint64_t epid = 0U;
       ZbNwkSet(zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(uint64_t));

       /* Start-up from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: restoring stack persistence");
       status = ZbStartupPersist(zb, &cache_persistent_data.U8_data[4], cache_persistent_data.U32_data[0],NULL,APP_ZIGBEE_PersistCompleted_callback,NULL);
   }
   else
   {
       /* Failed to restart from persistence */
       APP_DBG("APP_ZIGBEE_ZbStartupPersist: no persistence data to restore");
       status = ZB_STATUS_ALLOC_FAIL;
   }

   /* Only for debug purpose, depending of persistent data, following traces
      could display bytes that are irrelevants to on off cluster */
   if(status == ZB_STATUS_SUCCESS)
   {
     /* read the last bytes of data where the ZCL on off persistent data shall be*/
      uint32_t len = cache_persistent_data.U32_data[0] + 4 ;
      APP_DBG("ClusterID %02x %02x",cache_persistent_data.U8_data[len-9],cache_persistent_data.U8_data[len-10]);
      APP_DBG("Endpoint %02x %02x",cache_persistent_data.U8_data[len-7],cache_persistent_data.U8_data[len-8]);
      APP_DBG("Direction %02x",cache_persistent_data.U8_data[len-6]);
      APP_DBG("AttrID %02x %02x",cache_persistent_data.U8_data[len-4],cache_persistent_data.U8_data[len-5]);
      APP_DBG("Len %02x %02x",cache_persistent_data.U8_data[len-2],cache_persistent_data.U8_data[len-3]);
      APP_DBG("Value %02x",cache_persistent_data.U8_data[len-1]);
   }

   return status;
}/* APP_ZIGBEE_ZbStartupPersist */

/**
 * @brief  timer callback to wait end of restore cluster persistence form M0
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PersistCompleted_callback(enum ZbStatusCodeT status,void *arg)
{
   if(status == ZB_WPAN_STATUS_SUCCESS)
   {
	   APP_DBG("Persist complete callback entered with SUCCESS");
	   set_default_attr_values();
   }
   else
   {
	   APP_DBG("Error in persist complete callback %x",status);
   }
   /* STEP3 - Activate back the persistent notification */
     /* Register Persistent data change notification */
     ZbPersistNotifyRegister(zigbee_app_info.zb,APP_ZIGBEE_persist_notify_cb,NULL);

     /* Call the callback once here to save persistence data */
     APP_ZIGBEE_persist_notify_cb(zigbee_app_info.zb,NULL);
}/* APP_ZIGBEE_PersistCompleted_callback */


/**
 * @brief  Load persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_persist_load(void)
{
#ifdef CFG_NVM
    APP_DBG("Retrieving persistent data from FLASH");
    bool status = APP_ZIGBEE_NVM_Read();

    if (status) {
    	unsigned len = cache_persistent_data.U32_data[0];
    	if (len > sizeof(struct persistence_attrs))
    	{
    		len -= sizeof(struct persistence_attrs);
    		cache_persistent_data.U32_data[0] = len;
    		struct persistence_attrs *persistence_attrs = (struct persistence_attrs *)&cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET + len];
    		APP_ZIGBEE_unpack_persist_values(persistence_attrs);
    	}
    }
    return status;
#else
    /* Check length range */
    if ((cache_persistent_data.U32_data[0] == 0) ||
        (cache_persistent_data.U32_data[0] > ST_PERSIST_MAX_ALLOC_SZ))
    {
        APP_DBG("No data or too large length : %d",cache_persistent_data.U32_data[0]);
        return false;
    }
    return true;
#endif /* CFG_NVM */
} /* APP_ZIGBEE_persist_load */

/**
 * @brief  Save persistent data
 * @param  None
 * @retval true if success , false if fail
 */
static bool APP_ZIGBEE_persist_save(void)
{
    uint32_t len;

    /* Clear the RAM cache before saving */
    memset(cache_persistent_data.U8_data, 0x00, ST_PERSIST_MAX_ALLOC_SZ);

    /* Call the stack API to get current persistent data */
    len = ZbPersistGet(zigbee_app_info.zb, 0, 0);
    /* Check Length range */
    if (len == 0U)
    {
        /* If the persistence length was zero then no data available. */
        APP_DBG("APP_ZIGBEE_persist_save: no persistence data to save !");
        return false;
    }
    if (len > ST_PERSIST_MAX_ALLOC_SZ - sizeof(struct persistence_attrs))
    {
        /* if persistence length too big to store */
        APP_DBG("APP_ZIGBEE_persist_save: persist size too large for storage (%d)", len);
        return false;
    }

    /* Store in cache the persistent data */
    len = ZbPersistGet(zigbee_app_info.zb, &cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET], len);

    /* Append attribute values that need to survive restarts. ZCL persistence code is unreliable, so implement the separate storage. */
    struct persistence_attrs *persistence_attrs = (struct persistence_attrs *)&cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET + len];
    APP_ZIGBEE_pack_persist_values(persistence_attrs);

    /* Store in cache the persistent data length */
    cache_persistent_data.U32_data[0] = len + sizeof(struct persistence_attrs);

    persistNumWrites++;
    APP_DBG("APP_ZIGBEE_persist_save: Persistence written in cache RAM (num writes = %d) len=%d",
             persistNumWrites, cache_persistent_data.U32_data[0]);

#ifdef CFG_NVM
    if(!APP_ZIGBEE_NVM_Write())
    {
    	return false;
    }

    APP_DBG("APP_ZIGBEE_persist_save: Persistent data FLASHED");
#endif /* CFG_NVM */

